app/controllers/restaurants_controller.rb

INSERT INTO "restaurants" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "KFC"], ["created_at", "2016-08-23 10:25:37.509477"], ["updated_at", "2016-08-23 10:25:37.509477"]]
---
  def create
    @restaurant = Restaurant.new(restaurant_params)
    if @restaurant.save