app/controllers/reviews_controller.rb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 6]]
INSERT INTO "reviews" ("thoughts", "rating", "user_id", "restaurant_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["thoughts", "so so"], ["rating", 3], ["user_id", 5], ["restaurant_id", 6], ["created_at", "2016-08-25 15:59:17.073038"], ["updated_at", "2016-08-25 15:59:17.073038"]]
---
  def create
    @restaurant = Restaurant.find params[:restaurant_id]
    @review = @restaurant.reviews.build_with_user review_params, current_user

    if @review.save